In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df['col2'].unique()

array([444, 555, 666])

In [4]:
df['col2'].nunique() # 고유값의 수

3

In [5]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [6]:
# 조건부 선택
# Col 1 > 2
# col2 == 444
newdf =  df[ (df['col1']>2) &(df['col2'] == 444 )]

In [7]:
newdf

   col1  col2 col3
3     4   444  xyz

# 함수를 열의 모든 값에 적용해보기

In [8]:
def times_two(number):
    return number*2

In [9]:
times_two(4)

8

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
df.apply(times_two)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [13]:
#만약 하나의 열에 대해서만 적용하려면
df['new']=df['col1'].apply(times_two)

In [14]:
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [15]:
del df['new']

In [16]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [17]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [20]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [21]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [22]:
df.sort_values('col2') # 열을 기준으로 정렬

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [24]:
df.sort_values('col2',ascending=False) # 오름차순 내림차순 설정

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz